In [2]:
#pandas series
from pandas import Series
se=Series([1,3,5,7,9])
se

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
se[2]

5

In [5]:
#giving own index position to the series
se1=Series([100,200,300],index=['a','b','c'])
se1

a    100
b    200
c    300
dtype: int64

In [6]:
se1['b']

200

In [8]:
se1[1]

200

In [9]:
#Converting a dictionary to a series
salary={'John':100000,'Tim':200000,'Rob':300000}
salary

{'John': 100000, 'Tim': 200000, 'Rob': 300000}

In [11]:
se2=Series(salary)
se2

John    100000
Tim     200000
Rob     300000
dtype: int64

In [12]:
se2['Rob']

300000

In [13]:
se2[2]

300000

In [16]:
#Data frames
from pandas import DataFrame
data={'Name':["Pankaj","Amyra","Sara"],
      "age":[20,23,24],
      "salary":[100000,200000,300000]
     }

In [17]:
frame=DataFrame(data)
frame

     Name  age  salary
0  Pankaj   20  100000
1   Amyra   23  200000
2    Sara   24  300000